
public class CollectionFrameworkBasic {

}

//	컬렉션 프레임워크 
//	
//	데이터 군을 저장하는 클래스들을 표준화한 설계를 뜻한다
//	
//	컬렉션은
//	다수의 데이터, 즉 데이터 그룹
//	
//	프레임워크는
//	표준화된 프로그래밍 방식을 의미
//	
//	인터페이스(예약어)			특징
//	List				순서가 있는 데이터의 집합, 데이터의 중복을 허용한다
//						List는 크기가 유동적이다 -> 선언할때 ArrayList aaa = new ArrayList(); 
//						크기가 유동적이므로 크기를 따로 선언하지 않는다. add()를 통해 추가시 계속추가됨
//						구현클래스: ArrayList 등
//						
//	
//	Set					순서를 유지하지 않는 데이터의 집합, 데이터의 중복을 허용하지 않는다
//	
//	
//	Map					키(Key)와 값(Value)의 쌍으로 이루어진 데이터의 집합
//						순서는 유지되지 않으며, 키는 중복을 허용하지 않고,
//						값은 중복을 허용한다
//						많은 양의 데이터를 검색하는데 있어서 뛰어난 성능
//						구현클래스: HashMap 등

